<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
        <key>Comment</key>
        <string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
        <key>Description</key>
        <string>Downloads the latest version of Smart Scroll and creates a package.</string>
        <key>Identifier</key>
        <string>com.github.shaquir.pkg.SmartScroll</string>
        <key>Input</key>
        <dict>
                <key>NAME</key>
                <string>Smart Scroll</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.shaquir.download.SmartScroll</string>
        <key>Process</key>
        <array>
                <dict>
                        <key>Processor</key>
                        <string>AppPkgCreator</string>
                </dict>
        <dict>
                <key>Processor</key>
                <string>FileMover</string>
                <key>Arguments</key>
                <dict>
                        <key>source</key>
                        <string>%pathname%/Smart Scroll.prefPane</string>
                        <key>target</key>
                        <string>%pkgroot%/Library/PreferencePanes/Smart Scroll.prefPane</string>
                </dict>
        </dict>
        </array>
</dict>
</plist>
