<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
        <key>Comment</key>
        <string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
        <key>Description</key>
        <string>Downloads the latest version of Smart Scroll.</string>
        <key>Identifier</key>
        <string>com.github.shaquir.download.SmartScroll</string>
        <key>Input</key>
        <dict>
                <key>NAME</key>
                <string>Smart Scroll</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>filename</key>
                                <string>%NAME%.dmg</string>
                                <key>url</key>
                                <string>https://www.marcmoini.com/SmartScroll.dmg</string>
                        </dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                </dict>
                <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                </dict>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>input_path</key>
                                <string>%pathname%/Smart Scroll.app</string>
                                <key>requirement</key>
                                <string>anchor apple generic and identifier "com.marcmoini.smartscroll4" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certifificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = YCNT5XP4N5)</string>
                        </dict>
                        <key>Processor</key>
                        <string>CodeSignatureVerifier</string>
                </dict>
                <dict>
                <key>Processor</key>
                <string>FileMover</string>
                <key>Arguments</key>
                <dict>
                        <key>source</key>
                        <string>%pathname%/Smart Scroll.prefPane</string>
                        <key>target</key>
                        <string>%pkgroot%/Library/PreferencePanes/Smart Scroll.prefPane</string>
                </dict>
                </dict>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>input_plist_path</key>
                                <string>%pathname%/Smart Scroll.app/Contents/Info.plist</string>
                                <key>plist_version_key</key>
                                <string>CFBundleShortVersionString</string>
                        </dict>
                        <key>Processor</key>
                        <string>Versioner</string>
                </dict>
        </array>
</dict>
</plist>
