<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Witch disk image and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.shaquir.pkg.Witch</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Witch</string>
		<key>bundleid</key>
		<string>com.shaquir.pkg.Witch</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.shaquir.download.Witch</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Witch.prefPane/Contents/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict>
					<key>Library</key>
					<string>01775</string>
					<key>Library/PreferencePanes</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/Witch.prefPane</string>
				<key>destination_path</key>
				<string>%pkgroot%/Library/PreferencePanes/Witch.prefPane</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>id</key>
					<string>%bundleid%</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>