Description: Recipe description
Identifier: com.github.shaquir.jamf.RocketChat
Input:
  NAME: Rocket Chat
  CATEGORY: Communications
  GROUP_NAME: "autopkg-%NAME%"
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  POLICY_NAME: "Install Latest %NAME%"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  SELF_SERVICE_DISPLAY_NAME: "Install Latest %NAME%"
  SELF_SERVICE_DESCRIPTION: Rocket Chat Client
  INSTALL_BUTTON_TEXT: "Install %version%"
  SELF_SERVICE_ICON: RocketChatClient.png
  REINSTALL_BUTTON_TEXT: "Install %version%"
  UPDATE_PREDICATE: "pkg_uploaded == False"
MinimumVersion: '2.3'
ParentRecipe: com.github.shaquir.pkg.RocketChat
Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: "%CATEGORY%"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader

- Processor: StopProcessingIf
  Arguments:
    predicate: "%UPDATE_PREDICATE%"

- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_template: "%GROUP_TEMPLATE%"
    computergroup_name: "%GROUP_NAME%"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    policy_template: "%POLICY_TEMPLATE%"
    policy_name: "%POLICY_NAME%"
    icon: "%SELF_SERVICE_ICON%"
