<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Extract the flat package from the macFUSE dmg.</string>
    <key>Identifier</key>
    <string>com.github.shaquir.pkg.openvpn</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenVPN</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.shaquir.download.openvpn</string>
    <key>Process</key>
    <array>
        <dict>
        <key>Comment</key>
        <string>Copy the pkg out of the DMG as it's flat and there's no need for the DMG</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/OpenVPN_Connect*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/OpenVPN-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
                    			<string>%RECIPE_CACHE_DIR%/pkgroot/</string>
				</array>
			</dict>
		</dict>	 
    </array>
</dict>
</plist>