Description: Recipe description
Identifier: com.github.shaquir.jamf.PyCharm
Input:
  NAME: PyCharm
  CATEGORY: Editors
  GROUP_NAME: "autopkg-%NAME%"
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  POLICY_NAME: "Install Latest %NAME%"
  POLICY_RUN_COMMAND: "echo 'Installation of %NAME% complete'"
  SELF_SERVICE_DISPLAY_NAME: "Install Latest %NAME%"
  SELF_SERVICE_DESCRIPTION: PyCharm is an Integrated Development Environment (IDE) used for programming in Python. It provides code analysis, a graphical debugger, an integrated unit tester, integration with version cont    rol systems (VCSes), and supports web development with Django.
  INSTALL_BUTTON_TEXT: "Install %version%"
  SELF_SERVICE_ICON: PyCharm.png
  REINSTALL_BUTTON_TEXT: "Install %version%"
  UPDATE_PREDICATE: "pkg_uploaded == False"
MinimumVersion: '2.3'
ParentRecipe: com.github.chilcote.pkg.PyCharm

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
