Description: 1Password description
Identifier: com.github.shaquir.jamf.1Password
ParentRecipe: io.github.hjuutilainen.pkg.1Password
MinimumVersion: '2.3'

Input:
  NAME: 1Password
  CATEGORY: Utilities
  GROUP_NAME: 'autopkg-%NAME%'
  GROUP_TEMPLATE: SmartGroup-update-smart-regex.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: Policy-install-latest.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: '1Password for Mac lets you keep all of your log-ins in one place, so you'll never have to worry about forgetting passwords again. And all of the information you enter into this app is protected by a master password, which means you won't have to worry about unauthorized access, either.'
  SELF_SERVICE_ICON: '%NAME%.png'
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'
    
- Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
